//Напишите, являются ли данные имена переменных корректными:
//let mode = "normal"; - да, переменная отвечает своему назначению на английском языке.
//let my_valu3 = 102; - непонятно о чем идет речь.. неясное название.
//let 3my_value3 = "102"; - не рекомендуется начинать с цифры + непонятно что имеется в виду.
//let __hello__ = "world"; - непонятен смысла переменной hello, хотя можно начинать с _, но я бы не стал начинать с __ - ассоциации с 
// magic методом в питоне))
//let $$$ = "money"; - можно начинать с $, но опять же не очень понятно какие деньги имеются в виду.
//let !0_world = true; - с ! начинать нельзя.

